const dishes = new Map(Object.entries({
  "домашняя": [
    {
      "dish": "Домашние пельмени",
      "products": [
        "тесто",
        "мясо",
        "соль",
        "перец"
      ],
      "tags": [
        "мучное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Овощной салат",
      "products": [
        "огурцы",
        "помидоры",
        "редис",
        "лук",
        "майонез"
      ],
      "tags": [
        "прочее",
        "овощи"
      ]
    },
    {
      "dish": "Салат Цезарь",
      "products": [
        "салат",
        "куриное филе",
        "помидоры черри",
        "батон",
        "пармезан",
        "чеснок",
        "масло",
        "соль",
        "перец"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "мучное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Сырники",
      "products": [
        "творог",
        "яйца",
        "соль",
        "сахар",
        "мука",
        "масло"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Драники классические",
      "products": [
        "картошка",
        "яйца",
        "мука",
        "лук",
        "масло",
        "соль"
      ],
      "tags": [
        "молочное",
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Солянка классическая",
      "products": [
        "говядина",
        "картошка",
        "колбаса варенная",
        "колбаса копченная",
        "соленые огурцы",
        "лук",
        "морковь",
        "томатная паста",
        "масло",
        "лавровый лист",
        "маслины"
      ],
      "tags": [
        "прочее",
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Сочные котлеты",
      "products": [
        "фарш мясной",
        "батон",
        "молоко",
        "лук",
        "панировочные сухари",
        "соль",
        "растительное масло"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "мучное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Шарлотка с яблоками",
      "products": [
        "яблоки",
        "мука",
        "сахар",
        "яйца",
        "соль"
      ],
      "tags": [
        "фрукты",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Классический жульен",
      "products": [
        "шампиньоны",
        "твердый сыр",
        "масло",
        "перец черный молотый",
        "соль",
        "молоко",
        "мука",
        "мускатный орех"
      ],
      "tags": [
        "молочное",
        "специи",
        "овощи",
        "прочее"
      ]
    },
    {
      "dish": "Оливье классический",
      "products": [
        "картошка",
        "морковь",
        "соленые огурцы",
        "зеленый горошек",
        "колбаса варенная",
        "яйца",
        "укроп",
        "майонез"
      ],
      "tags": [
        "молочное",
        "овощи",
        "прочее",
        "мясо"
      ]
    },
    {
      "dish": "Гороховый суп с копченостями",
      "products": [
        "горох",
        "копченые ребрышки",
        "вода",
        "лук",
        "морковь",
        "картошка",
        "масло",
        "перец горошком",
        "лавровый лист",
        "соль"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Торт медовик",
      "products": [
        "масло сливочное",
        "яйца",
        "соль",
        "сахар",
        "мука",
        "мёд",
        "сода пищевая",
        "молоко",
        "ванилин"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Курник классический",
      "products": [
        "пшеничная мука",
        "яйца",
        "масло",
        "сметана",
        "сода пищевая",
        "соль",
        "сахар",
        "куриные окорочка",
        "лук",
        "морковь",
        "картошка",
        "перец черный молотый"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Бефстроганов из говядины",
      "products": [
        "говядина",
        "лук",
        "томатная паста",
        "мука",
        "сметана",
        "растительное масло",
        "соль",
        "перец черный молотый"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    }
  ],
  "восточная": [
    {
      "dish": "Шакшука по-арабски",
      "products": [
        "куриное филе",
        "помидоры",
        "яйца",
        "лук",
        "перец красный",
        "чеснок",
        "масло",
        "зира",
        "зелень",
        "паприка"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Шурпа из свинины",
      "products": [
        "свинина",
        "болгарский перец",
        "помидоры",
        "чеснок",
        "репчатый лук",
        "морковь",
        "картофель",
        "укроп",
        "соль",
        "кориандр"
      ],
      "tags": [
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Курица в соевом маринаде",
      "products": [
        "курица",
        "масло",
        "зелень",
        "соевый соус",
        "лук",
        "чеснок",
        "имбирь",
        "кориандр",
        "сахар",
        "кетчуп"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Самса из слоёного теста",
      "products": [
        "слоёное тесто",
        "мясной фарш",
        "лук",
        "масло",
        "специи",
        "яйца",
        "кунжут"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Хумус классический",
      "products": [
        "нут",
        "кунжут",
        "лимонный сок",
        "чеснок",
        "масло",
        "соль",
        "перец"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Лепешки с тыквой",
      "products": [
        "масло",
        "соль",
        "мука",
        "тыква",
        "лук",
        "перец черный",
        "соль",
        "сахар",
        "масло"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Форель запеченная с овощами",
      "products": [
        "форель филе",
        "помидоры",
        "перец сладкий",
        "лук",
        "чеснок",
        "масло",
        "соевый соус",
        "мёд",
        "соус чили",
        "лимонный сок",
        "соль",
        "перец"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Салат из запеченных овощей",
      "products": [
        "баклажан",
        "перец сладкий",
        "помидоры",
        "лук",
        "чеснок",
        "мёд",
        "бальзамический уксус",
        "лук",
        "кинза",
        "петрушка",
        "укроп",
        "соль",
        "перец"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Печенье \"Курабье\"",
      "products": [
        "мука",
        "сахарная пудра",
        "масло",
        "яйца",
        "пряности",
        "повидло"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Мясной пирог на кефире",
      "products": [
        "свинина",
        "лук",
        "чеснок",
        "зелень",
        "соль",
        "перец",
        "сливки",
        "мука",
        "кефир",
        "масло",
        "яйца",
        "кунжут "
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Лагман из баранины",
      "products": [
        "мука",
        "яйца",
        "соль",
        "баранина",
        "лук",
        "томатная паста",
        "куркума",
        "паприка",
        "перец",
        "картофель",
        "помидоры",
        "морковь",
        "чеснок"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Люля кебаб из куриного фарша",
      "products": [
        "курица",
        "лук",
        "чеснок",
        "петрушка",
        "уксус",
        "соль",
        "перец",
        "масло"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Пряный томатный суп с нутом",
      "products": [
        "картофель",
        "лук",
        "чеснок",
        "морковь",
        "брокколи",
        "помидоры",
        "нут",
        "имбирь",
        "кориандр "
      ],
      "tags": [
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Клубничный щербет",
      "products": [
        "клубника",
        "йогурт питьевой",
        "сахар",
        "сок лимона"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "молочное",
        "специи"
      ]
    }
  ],
  "грузинская": [
    {
      "dish": "Оджахури",
      "products": [
        "шея свиная",
        "картофель",
        "лук репчатый",
        "помидоры",
        "чеснок",
        "масло растительное",
        "соль",
        "хмели-сунели",
        "зелень "
      ],
      "tags": [
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Чахохбили по-грузински",
      "products": [
        "курица",
        "масло",
        "лук репчатый",
        "томатная паста",
        "помидоры",
        "перец сладкий",
        "чеснок",
        "аджика",
        "перец",
        "соль",
        "кинза "
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Хачапури по-аджарски",
      "products": [
        "молоко",
        "вода",
        "мука",
        "дрожжи сухие",
        "яйца",
        "соль",
        "сахар",
        "масло растительное",
        "сыр моцарелла",
        "сыр",
        "яйца",
        "масло сливочное"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Суп «Харчо»",
      "products": [
        "курица",
        "рис",
        "чеснок",
        "масло сливочное",
        "лук репчатый",
        "морковь",
        "томатная паста",
        "зелень",
        "соль"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Лобио",
      "products": [
        "фасоль",
        "лук репчатый",
        "чеснок",
        "перец красный",
        "соль",
        "кориандр",
        "масло сливочное",
        "уксус винный",
        "масло"
      ],
      "tags": [
        "молочное",
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Сациви из курицы",
      "products": [
        "чеснок",
        "орех грецкий",
        "лук репчатый",
        "шафран",
        "хмели-сунели",
        "перец чили",
        "кориандр",
        "уксус винный",
        "перец чёрный молотый",
        "масло растительное"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Хинкали домашние",
      "products": [
        "говядина",
        "свинина",
        "мука пшеничная",
        "лук репчатый",
        "кинза",
        "зелень",
        "вода",
        "яйца",
        "соль",
        "перец чёрный"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Чурчхела",
      "products": [
        "орех фундук",
        "орех грецкий",
        "сок виноградный",
        "мука пшеничная"
      ],
      "tags": [
        "прочее",
        "специи"
      ]
    },
    {
      "dish": "Цыплята табака",
      "products": [
        "цыпленок",
        "соль",
        "перец чёрный",
        "чеснок",
        "масло растительное"
      ],
      "tags": [
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Каурма из свинины",
      "products": [
        "свинина",
        "масло",
        "лук репчатый",
        "томатная паста",
        "зелень",
        "чеснок",
        "перец жгучий",
        "хмели-сунели",
        ""
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Салат с печенью и перцем",
      "products": [
        "печень куриная",
        "помидоры",
        "перец болгарский",
        "лук репчатый",
        "орех грецкий",
        "зелень",
        "чеснок",
        "мука",
        "масло растительное"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Мясо в цахтоне",
      "products": [
        "говядина",
        "телятина",
        "сметана",
        "петрушка",
        "кинза",
        "укроп",
        "чеснок",
        "соль"
      ],
      "tags": [
        "специи",
        "молочное",
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Люля-кебаб",
      "products": [
        "фарш из баранины",
        "сало курдючное",
        "лук репчатый",
        "зира",
        "кориандр",
        "перец чёрный молотый",
        "соль",
        "масло растительное"
      ],
      "tags": [
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Капуста по-гурийски",
      "products": [
        "капуста",
        "свекла",
        "морковь",
        "чеснок",
        "перец острый",
        "хмели-сунели",
        "сахар",
        "соль",
        "масло подсолнечное"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    }
  ],
  "американская": [
    {
      "dish": "Панкейки",
      "products": [
        "яйца",
        "молоко",
        "мука пшеничная",
        "сахар"
      ],
      "tags": [
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Тыквенные синнабоны",
      "products": [
        "молоко",
        "яйца",
        "масло подсолнечное",
        "сахар",
        "дрожжи свежие",
        "тыква",
        "мука",
        "мёд",
        "соль",
        "корица",
        "масло сливочное",
        "сыр сливочный"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи",
        "овощи"
      ]
    },
    {
      "dish": "Салат \"Цезарь\"",
      "products": [
        "хлеб",
        "курица",
        "помидоры",
        "салат",
        "яйца",
        "чеснок",
        "масло растительное",
        "горчица"
      ],
      "tags": [
        "прочее",
        "овощи",
        "мясо",
        "молочное"
      ]
    },
    {
      "dish": "Буррито",
      "products": [
        "фарш мясной",
        "лук репчатый",
        "фасоль",
        "лечо острое",
        "сыр",
        "салат",
        "помидоры",
        "тортилья"
      ],
      "tags": [
        "молочное",
        "овощи",
        "прочее",
        "мясо"
      ]
    },
    {
      "dish": "Чаудер",
      "products": [
        "рыба",
        "криветка",
        "краб",
        "лобстер",
        "мидии",
        "устрицы",
        "картофель",
        "сельдирей",
        "лук",
        "масло сливочное",
        "молоко",
        "укроп",
        "соль",
        "перец"
      ],
      "tags": [
        "молочное",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Бургер классический",
      "products": [
        "фарш мясной",
        "сыр",
        "помидоры",
        "огурец",
        "лук",
        "салат",
        "майонез",
        "кетчуп",
        "перец",
        "соль",
        "масло подсолнечное",
        "булочка"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Хот-дог",
      "products": [
        "булочка",
        "сосиски",
        "сыр",
        "морковь-по корейски",
        "майонез",
        "кетчуп"
      ],
      "tags": [
        "прочее",
        "молочное",
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Шоколадный брауни с мандаринами",
      "products": [
        "мандарин",
        "шоколад",
        "мука пшеничная",
        "мука кукурузная",
        "масло сливочное",
        "сахар",
        "яйца"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Куриные крылья «Буффало»",
      "products": [
        "куриные крылышки",
        "масло растительное",
        "чеснок",
        "соль",
        "майонез",
        "сметана",
        "сыр",
        "лук зелёный",
        "уксус"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Хэшбраун",
      "products": [
        "картофель",
        "соль",
        "масло растительное"
      ],
      "tags": [
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Суп \"Гамбо\"",
      "products": [
        "куриные бедрышки",
        "колбаса",
        "перец болгарский",
        "сельдерей",
        "лук репчатый",
        "морковь"
      ],
      "tags": [
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Перцы по-техасски",
      "products": [
        "перец болгарский",
        "рис отварной",
        "кукуруза",
        "фасоль",
        "лук",
        "помидоры"
      ],
      "tags": [
        "прочее",
        "овощи"
      ]
    },
    {
      "dish": "Сливовый пирог",
      "products": [
        "слива",
        "сахар",
        "соль",
        "масло сливочное",
        "мука",
        "яйца",
        "разрыхлитель",
        "корица молотая",
        "сахар",
        "масло сливочное"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Луковые кольца в кляре",
      "products": [
        "лук репчатый",
        "яйца",
        "мука",
        "чеснок",
        "соль",
        "перец чёрный молотый",
        "масло растительное"
      ],
      "tags": [
        "молочное",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Лимонные кексы",
      "products": [
        "лимон",
        "яйца",
        "сахар",
        "мука",
        "разрыхлитель",
        "масло подсолнечное"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Американские пончики",
      "products": [
        "молоко",
        "дрожжи сухие",
        "соль",
        "сахар",
        "масло сливочное",
        "желток",
        "сахар",
        "мука",
        "пудра сахарная",
        "молоко"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Куриные крылышки",
      "products": [
        "куриные крылышки",
        "майонез",
        "аджика",
        "соль",
        "масло растительное",
        "зелень",
        "соус"
      ],
      "tags": [
        "прочее",
        "специи",
        "мясо"
      ]
    }
  ],
  "азиатская": [
    {
      "dish": "Кимчи Рамен",
      "products": [
        "курица",
        "морковь",
        "лук репчатый",
        "чеснок",
        "яйца",
        "тимьян",
        "соль",
        "лавровый лист",
        "петрушка",
        "лук зелёный",
        "лапша",
        "капуста",
        "имбирь",
        "кунжут"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Фунчоза с курицей и овощами",
      "products": [
        "лапша",
        "куриное филе",
        "морковь",
        "перец сладкий",
        "лук-порей",
        "лук зелёный",
        "зелень",
        "кунжут",
        "чеснок",
        "имбирь"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Мясо по-тайски",
      "products": [
        "свинина",
        "лук репчатый",
        "морковь",
        "перец болгарский",
        "чеснок",
        "соус соевый",
        "лимон",
        "мёд",
        "перец молотый",
        "масло растительное",
        "соль"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Лапша удон с курицей и овощами",
      "products": [
        "лапша",
        "куриное филе",
        "перец болгарский",
        "морковь",
        "кабачки",
        "соус соевый",
        "соль",
        "перец чёрный молотый",
        "кунжут"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Чоу фан - жареный рис",
      "products": [
        "рис",
        "чеснок",
        "перец болгарский",
        "перец острый",
        "лук репчатый",
        "яйца",
        "баклажан",
        "шампиньоны",
        "соус соевый",
        "масло кунжутное",
        "лук зелёный"
      ],
      "tags": [
        "молочное",
        "овощи",
        "прочее"
      ]
    },
    {
      "dish": "Лагман с курицей",
      "products": [
        "лапша",
        "куриное филе",
        "помидоры",
        "перец болгарский",
        "морковь",
        "лук репчатый",
        "томатная паста",
        "сахар",
        "соль"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Тайский суп том-ям",
      "products": [
        "молоко кокосовое",
        "куриное филе",
        "шампиньоны",
        "креветки",
        "корень имбиря",
        "лимон",
        "чеснок",
        "перец чили",
        "масло растительное",
        "сок лимона",
        "сахар"
      ],
      "tags": [
        "прочее",
        "фрукты",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Капуста кимчи",
      "products": [
        "капуста пекинская",
        "перец острый",
        "перец сладкий",
        "соль",
        "кориандр",
        "имбирь молотый",
        "чеснок",
        "перец острый"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Курица в кляре и соусе",
      "products": [
        "куриное филе",
        "белок",
        "крахмал",
        "соус соевый",
        "семя кунжута",
        "сок лимона",
        "мёд",
        "горчица",
        "горчица",
        "чеснок",
        "перец чёрный молотый",
        "базилик"
      ],
      "tags": [
        "прочее",
        "молочное",
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Cвекла по-корейски",
      "products": [
        "свекла",
        "чеснок",
        "кориандр",
        "перец чёрный молотый",
        "паприка молотая",
        "масло подсолнечное",
        "уксус столовый",
        "соль"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Темари",
      "products": [
        "рыба красная",
        "рис",
        "уксус рисовый",
        "сахар",
        "соль",
        "семя кунжута",
        "соус соевый",
        "имбирь маринованный",
        "васаби"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Ордубадские рулеты",
      "products": [
        "мука",
        "сметана",
        "масло сливочное",
        "орех грецкий",
        "сахар",
        "соль",
        " мёд",
        "желток",
        "пудра сахарная"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Паровые пирожки пян-се ",
      "products": [
        "тесто дрожжевое",
        "капуста",
        "лук репчатый",
        "говядина",
        "свинина",
        "чеснок",
        "соль",
        "перец",
        "пряности",
        "масло растительное"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Салат с курицей и овощами",
      "products": [
        "куриная грудка",
        "капуста",
        "перец болгарский",
        "морковь",
        "масло растительное",
        "соус соевый",
        "уксус",
        "сок лимона"
      ],
      "tags": [
        "прочее",
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Ладду из сухофруктов",
      "products": [
        "изюм",
        "курага",
        "орех",
        "кунжут",
        "кокосовая стружка",
        "кокосовая стружка"
      ],
      "tags": [
        "прочее",
        "специи"
      ]
    },
    {
      "dish": "Баурсаки",
      "products": [
        "мука пшеничная",
        "майонез",
        "сметана",
        "сода",
        "соль",
        "сахар",
        "масло"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Салат \"Чафан\"",
      "products": [
        "картофель",
        "говядина",
        "лук репчатый",
        "свекла",
        "морковка корейская",
        "масло растительное",
        "зелень петрушки",
        "зелень укропа",
        "лук зелёный",
        "майонез"
      ],
      "tags": [
        "прочее",
        "овощи",
        "мясо"
      ]
    }
  ],
  "итальянская": [
    {
      "dish": "Тосканский суп с фаршем",
      "products": [
        "фарш свиной",
        "картофель",
        "лук репчатый",
        "чеснок",
        "сливки",
        "масло сливочное",
        "сыр твёрдый",
        "паприка молотая",
        "соль",
        "перец чёрный молотый"
      ],
      "tags": [
        "молочное",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Салат \"Пармиджано\"",
      "products": [
        "салат",
        "помидоры черри",
        "баклажан",
        "сыр моцарелла",
        "масло",
        "соль морская",
        "хлебная крошка",
        "сухари панировочные",
        "травы",
        "чеснок",
        "помидоры"
      ],
      "tags": [
        "молочное",
        "специи",
        "овощи",
        "прочее"
      ]
    },
    {
      "dish": "Паста \"Карбонара\"",
      "products": [
        "спагетти",
        "грудинка",
        "яйца",
        "желток",
        "сыр пармезан",
        "масло сливочное",
        "масло оливковое",
        "чеснок",
        "соль",
        "перец чёрный"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Курица по-итальянски",
      "products": [
        "куриные ножки",
        "лук репчатый",
        "шампиньоны",
        "помидоры",
        "перец болгарский",
        "чеснок"
      ],
      "tags": [
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Лазанья классическая",
      "products": [
        "лук",
        "перец болгарский",
        "масло оливковое",
        "фарш мясной",
        "томатная паста",
        "кетчуп",
        "сыр твёрдый",
        "творог",
        "сливки",
        "зелень",
        "соль",
        "перец"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Чиабатта ",
      "products": [
        "мука пшеничная",
        "дрожжи сухие",
        "масло оливковое",
        "соль",
        "вода"
      ],
      "tags": [
        "прочее",
        "специи"
      ]
    },
    {
      "dish": "Торт \"Капрезе\"",
      "products": [
        "шоколад черный",
        "шоколад",
        "масло сливочное",
        "яйца",
        "сахар",
        "миндаль",
        "какао-порошок"
      ],
      "tags": [
        "прочее",
        "молочное",
        "специи"
      ]
    },
    {
      "dish": "Говядина в вине ",
      "products": [
        "говядина",
        "вино",
        "чеснок",
        "перец чёрный",
        "лавровый лист",
        "соль"
      ],
      "tags": [
        "прочее",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Ньокки в сливочно-грибном соусе",
      "products": [
        "картофель",
        "сыр пармезан",
        "яйца",
        "мука",
        "шампиньоны",
        "сливки",
        "сыр"
      ],
      "tags": [
        "молочное",
        "овощи",
        "специи"
      ]
    },
    {
      "dish": "Ризотто с курицей и грибами",
      "products": [
        "масло сливочное",
        "грибы",
        "куриное филе",
        "соль",
        "перец чёрный молотый",
        "бульон куриный",
        "масло",
        "лук",
        "рис",
        "вино белое сухое",
        "сыр пармезан",
        "зелень "
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Спагетти Болоньезе",
      "products": [
        "масло сливочное",
        "лук репчатый",
        "чеснок",
        "морковь",
        "ветчина копченая",
        "говядина",
        "орегано",
        "вино красное сухое",
        "бульон мясной",
        "томатная паста"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Итальянский куриный суп",
      "products": [
        "куриное филе",
        "вермишель",
        "кукуруза",
        "сливки",
        "крахмал кукурузный",
        "молоко",
        "соль",
        "перец чёрный молотый"
      ],
      "tags": [
        "молочное",
        "овощи",
        "специи",
        "мясо"
      ]
    },
    {
      "dish": "Курица по-итальянски",
      "products": [
        "куриные окорочка",
        "перец болгарский красный",
        "перец болгарский",
        "перец острый",
        "чеснок"
      ],
      "tags": [
        "овощи",
        "мясо"
      ]
    },
    {
      "dish": "Картофельный \"Гато\" ",
      "products": [
        "картофель",
        "яйца",
        "колбаса",
        "сыр твёрдый",
        "соус",
        "сыр моцарелла",
        "соль",
        "перец чёрный молотый",
        "орех мускатный",
        "сухари панировочные",
        "масло"
      ],
      "tags": [
        "прочее",
        "овощи",
        "молочное",
        "специи",
        "мясо"
      ]
    }
  ]
}))


const cuisines = [
  "Итальянская",
  "Домашняя",
  "Азиатская",
  "Американская",
  "Восточная",
  "Грузинская"
];

const tags = [
  "Мясо",
  "Мучное",
  "Специи",
  "Молочное",
  "Овощи",
  "Прочее",
  "Фрукты"
];


const getDishes = (cuisines, includeProducts, excludeProducts) => {
  let filteredDishes = [];
  if (cuisines) {
    cuisines.forEach((item) => {
      filteredDishes.push(...dishes.get(item));
    })
  } else {
    dishes.forEach((item) => {
      filteredDishes.push(...item)
    })
  }
  let prefilteredDishes = [];
  filteredDishes.forEach((dish) => {
    let ok = true;

    if (includeProducts.length === 0) ok = false;
    includeProducts.forEach((tag) => {
      if (!dish.tags.includes(tag)) {
        ok = false;
      }
    });

    excludeProducts.forEach((tag) => {
      if (dish.tags.includes(tag)) {
        ok = false;
      }
    })
    if (ok) prefilteredDishes.push(dish);
  })

  return prefilteredDishes;
}

const getSelectedOptions = (rootId) => {
  const dropdown = document.getElementById(rootId);
  const options = dropdown.getElementsByTagName("div");
  let values = [];
  for (let i = 0; i < options.length; i++) {
    if (options[i].firstChild.value && options[i].firstChild.checked) {
      values.push(options[i].firstChild.value.toLowerCase());
    }
  }
  return values;
}

const handleClick = (button) => {
  let cuisines = getSelectedOptions("cuisine-dropdown");
  let include = getSelectedOptions("include-dishes-dropdown");
  let exclude = getSelectedOptions("exclude-dishes-dropdown");
  let dishes = getDishes(cuisines, include, exclude);

  button.innerText = "назад";
  document.getElementById("choice-outer-container").style.display = 'none';
  renderMenu(dishes);
}

const createCheckbox = (value, checked) => {
  let option = document.createElement("div");
  let checkbox = document.createElement("input");
  let text = document.createElement("div")
  checkbox.type = "checkbox";
  checkbox.value = value;
  checkbox.checked = checked;
  option.appendChild(checkbox);
  text.innerText = value;
  option.appendChild(text);
  return option;
}
//<div class="menu-item">
//                                         <div class="menu-item__container">
//                                             <div class="menu-item__title">Суп-лапша</div>
//                                             <div class="menu-item__products">мука пшеничная, майонез, сметана, сода, соль,
//                                                 сахар, масло
//                                             </div>
//                                         </div>
//                                         <div class="menu-item__tags">прочее, молочное, специи</div>
//                                     </div>

const createMenuItem = (dish) => {
    let menuItem = document.createElement("div");
    menuItem.classList.add("menu-item");
    let menuItemContainer = document.createElement("div");
    menuItemContainer.classList.add("menu-item__container");
    let menuItemTitle = document.createElement("div");
    menuItemTitle.classList.add("menu-item__title");
    menuItemTitle.innerText = dish["dish"];
    let menuItemProducts = document.createElement("div");
    menuItemProducts.classList.add("menu-item__products");
    menuItemProducts.innerText = dish["products"].join(', ');
    let menuItemTags = document.createElement("div");
    menuItemTags.classList.add("menu-item__tags");
    menuItemTags.innerText = dish["tags"].join(', ');

    menuItem.appendChild(menuItemContainer);
    menuItemContainer.appendChild(menuItemTitle);
    menuItemContainer.appendChild(menuItemProducts);
    menuItem.appendChild(menuItemTags);
    return menuItem;
}


const renderDropdowns = (values, rootId, checked) => {
  let dropdownContainer = document.getElementById(rootId);

  values.forEach((value) => {
    dropdownContainer.appendChild(createCheckbox(value, checked));
  })
}


const renderMenu = (dishes) => {
  let menu = document.getElementById("menu-outer-container");
  dishes.forEach((dish) => {
    menu.appendChild(createMenuItem(dish));
  })

}

const init = () => {
  renderDropdowns(cuisines, "cuisine-dropdown", true)
  renderDropdowns(tags, "include-dishes-dropdown", true)
  renderDropdowns(tags, "exclude-dishes-dropdown", false)

  let button = document.getElementById("menu-button");
  button.addEventListener("click", () => {
    handleClick(button);
  })
}

init();